In [1]:
import pandas as pd
import numpy as np

In [15]:
df_1 =pd.DataFrame([[30,21]],columns=['Apples','Bananas'])
df_1

   Apples  Bananas
0      30       21

In [18]:
df_2 =pd.DataFrame([[30,21],[41,34]],index=['2017 Sales','2018 Sales'],columns=['Apples','Bananas'])
df_2

            Apples  Bananas
2017 Sales      30       21
2018 Sales      41       34

In [21]:
df_3 = pd.DataFrame([['Austin',139,'Sun'],['Dallas',237,'Sun'],['Austin',326,'Mon'],['Dallas',456,'Mon']],columns=['city','visitor','weekday'])
df_3

     city  visitor weekday
0  Austin      139     Sun
1  Dallas      237     Sun
2  Austin      326     Mon
3  Dallas      456     Mon

In [31]:
df_3.groupby('weekday').mean()

         visitor
weekday
Mon          391
Sun          188